# Bonus: Temperature Analysis I

In [35]:
import pandas as pd
from datetime import datetime as dt

In [36]:
# "tobs" is "temperature observations"
df = pd.read_csv('Resources/hawaii_measurements.csv')
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [37]:
df.dtypes

station     object
date        object
prcp       float64
tobs         int64
dtype: object

In [38]:
# Convert the date column format from string to datetime
df['date'] = pd.to_datetime(df['date'])
df

           station       date  prcp  tobs
0      USC00519397 2010-01-01  0.08    65
1      USC00519397 2010-01-02  0.00    63
2      USC00519397 2010-01-03  0.00    74
3      USC00519397 2010-01-04  0.00    76
4      USC00519397 2010-01-06   NaN    73
...            ...        ...   ...   ...
19545  USC00516128 2017-08-19  0.09    71
19546  USC00516128 2017-08-20   NaN    78
19547  USC00516128 2017-08-21  0.56    76
19548  USC00516128 2017-08-22  0.50    76
19549  USC00516128 2017-08-23  0.45    76

[19550 rows x 4 columns]

In [39]:
df.dtypes

station            object
date       datetime64[ns]
prcp              float64
tobs                int64
dtype: object

In [7]:
# Set the date column as the DataFrame index

In [40]:
# Drop the date column
date_df=df.set_index('date')
date_df.head()

                station  prcp  tobs
date
2010-01-01  USC00519397  0.08    65
2010-01-02  USC00519397  0.00    63
2010-01-03  USC00519397  0.00    74
2010-01-04  USC00519397  0.00    76
2010-01-06  USC00519397   NaN    73

### Compare June and December data across all years

In [41]:
import numpy as np
import scipy.stats as stats
from scipy import stats
from scipy import mean

In [42]:
# Filter data for desired months
target_month_june = 6 # 6=June
date_june=date_df.query('date.dt.month == @target_month_june')
date_june

                station  prcp  tobs
date
2010-06-01  USC00519397  0.00    78
2010-06-02  USC00519397  0.01    76
2010-06-03  USC00519397  0.00    78
2010-06-04  USC00519397  0.00    76
2010-06-05  USC00519397  0.00    77
...                 ...   ...   ...
2017-06-26  USC00516128  0.02    79
2017-06-27  USC00516128  0.10    74
2017-06-28  USC00516128  0.02    74
2017-06-29  USC00516128  0.04    76
2017-06-30  USC00516128  0.20    75

[1700 rows x 3 columns]

In [43]:
date_june.dtypes

station     object
prcp       float64
tobs         int64
dtype: object

In [44]:
# Identify the average temperature for June
ave_temp_june=date_june['tobs'].mean()
ave_temp_june

74.94411764705882

In [45]:
# Identify the average temperature for December
target_month_Dec = 12 # 12=December
date_dec=date_df.query('date.dt.month == @target_month_Dec')
date_dec

                station  prcp  tobs
date
2010-12-01  USC00519397  0.04    76
2010-12-03  USC00519397  0.00    74
2010-12-04  USC00519397  0.00    74
2010-12-06  USC00519397  0.00    64
2010-12-07  USC00519397  0.00    64
...                 ...   ...   ...
2016-12-27  USC00516128  0.14    71
2016-12-28  USC00516128  0.14    71
2016-12-29  USC00516128  1.03    69
2016-12-30  USC00516128  2.37    65
2016-12-31  USC00516128  0.90    65

[1517 rows x 3 columns]

In [46]:
ave_temp_Dec=date_dec['tobs'].mean()
ave_temp_Dec

71.04152933421226

In [47]:
# Run paired t-test

In [52]:
stats.ttest_ind(date_june['tobs'], date_dec['tobs'])

Ttest_indResult(statistic=31.60372399000329, pvalue=3.9025129038616655e-191)

### Analysis

In [ ]:
Paired T-Test
Paired t-test is used to determine the difference in the June and December average temperature in Honolulu, Hawaii for a time period between 2010 and 2017. 
The paired t-test is used because the two compared samples of temperature observations are related to the same location and represent a difference between summer temperature (after a cold season is over) and winter temperature (after a worm season is over).
The null hypothesis in this case is that there is no statistically significant difference in the mean of June temperature and December temperature in Honolulu, Hawaii.

In [ ]:
The t-statistic value is 31.603, and this can be used to calculate a p-value.
The p-value in this case is 3.902, which is far less than the standard thresholds of 0.05 or 0.01, 
so the null hypothesis is rejected and it can be concluded 
that there is a statistically significant difference between the June temperature and the December temperature in Honolulu, Hawaii.